Revit 2027 API
MessageBoxShowingEventArgs Properties
The MessageBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
DialogId |  A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.
(Inherited from DialogBoxShowingEventArgs)
DialogType |  An integer that describes the standard Windows type of the dialog box.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Message |  The message that has been displayed in the dialog box.
Top
See Also
Reference
MessageBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace